Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: The first section of this document provides an itemized checklist; subsequent sections provide a more detailed discussion of the items on the list.
es_es: La primera sección de este documento ofrece una lista detallada; las secciones siguientes proporcionan una descripción más detallada de los elementos de la lista.

source: Rather than this:
es_es: En lugar de esto:

source: \d a digit (0-9)
es_es: \d un dígito (0-9)

source: C<use strict "refs"> was ignoring taking a hard reference in an argument to defined(), as in :
es_es: C<use strict "refs"> hace caso omiso de una referencia dura en un argumento para defined(), como en:

source: While it's expecting the beginning of a new statement, if the compiler encounters a line that begins with an equal sign and a word, like this
es_es: Mientras que él espera el comienzo de una nueva instrucción, si el compilador encuentra una línea que comienza con un signo de igual y una palabra, como esta:

source: E.g., C<$obj-E<gt>as_string()>.
es_es: Ej., C<$obj-E<gt>como_cadena()>.

source: This binds a dbm(3), ndbm(3), sdbm(3), gdbm(3), or Berkeley DB file to a hash.
es_es: Liga un archivo dbm(3), ndbm(3), sdbm(3), gdbm(3), o Berkeley DB a un hash.

source: Documentation typo fix
es_es: Corrección de error tipográfico en la documentación

source: Beware, however, that in many system users are able to change this information and therefore it cannot be trusted and therefore the $gcos is tainted (see L<perlsec>).
es_es: Tenga cuidado, sin embargo, que en muchos sistemas los usuarios son capaces de cambiar esta información y por eso no puede confiarse y por eso el $gcos es considerado como contaminado (ver L<perlsec>).

source: exec ('foo') or print STDERR "couldn't exec foo: $!";
es_es: exec ('foo') or print STDERR "no puedo exec foo: $!";

source: =head3 Array Interpolation X<array, interpolation> X<interpolation, array> X<$">
es_es: =head3 Interpolación de Array X<array, interpolation> X<interpolation, array> X<$"> X<array, interpolación> X<interpolación, array>

source: =head1 Known Problems
es_es: =head1 Problemas conocidos

source: Here are the meanings of the fields:
es_es: Aquí están los significados de los campos:

source: (To be compatible with .Net regular expressions, C<\g{I<name>}> may also be written as C<\k{I<name>}>, C<\kE<lt>I<name>E<gt>> or C<\k'I<name>'>.) I<name> must not begin with a number, nor contain hyphens.
es_es: (Para ser compatible con las expresiones regulares .Net, C<\g{I<nombre>}> también se puede escribir como C<\k{I<nombre>}>, C<\kE<lt>I<nombre>E<gt>> o C<\k'I<nombre>'>.) I<nombre> no debe comenzar con un número, ni contener guiones.

source: For the reverse, see L</chr>.
es_es: Para lo contrario, vea L</chr>.

source: -M Script start time minus file modification time, in days.
es_es: -M Tiempo de arranque del script menos el tiempo de modificación del archivo, en días.

source: or later, and only with a C99 compiler (unportable)
es_es: o superior, y solo con un compilador C99 (no portable)

source: Currently EXPR with the value C<0> is also special-cased as C<1> (this was undocumented before Perl 5.8.0 and is subject to change in future versions of Perl).
es_es: Actualmente EXPR con el valor de C<0> es también un caso especial como el de C<1> (no estaba documentado esto antes de Perl 5.8.0 y está sujeto a cambios en futuras versiones de Perl).

source: =item pos SCALAR X<pos> X<match, position>
es_es: =item pos ESCALAR X<pos> X<match, position> X<coincidencia, posición>

source: =head2 More bugs
es_es: =head2 Más errores

source: =head1 NAME X<function>
es_es: =head1 NOMBRE X<function> X<función>

source: POP this
es_es: POP este

source: Unlike some other regular expression languages, there are no backslashed symbols that aren't alphanumeric.
es_es: A diferencia de algunos otros lenguajes de expresiones regulares, no hay símbolos escapados que no sean alfanuméricos.

source: $foo = 150 | '105'; # yields 255
es_es: $foo = 150 | '105'; # produce 255

source: You may, however, wish to treat a string as a multi-line buffer, such that the "^" will match after any newline within the string (except if the newline is the last character in the string), and "$" will match before any newline.
es_es: Puede, sin embargo, desear tratar a la cadena como un búfer de varias líneas, de modo que "^" coincidirá después de cualquier carácter nueva línea dentro de la cadena (excepto si el nueva línea es el último carácter en la cadena), y "$" coincidirá delante de cualquier carácter nueva línea.

source: $url = URI::URL->new( "http://example.com/" ); die if $url eq "xXx";
es_es: $url = URI::URL->new( "http://ejemplo.com/" ); die if $url eq "xXx";

source: chomp($pattern = <STDIN>);
es_es: chomp($patron = <STDIN>);

source: See L<perlop/"Yada Yada Operator">.
es_es: Vea L<perlop/"Operador Blablablá">.

source: =head2 Changed "Invalid range "%s" in transliteration operator"
es_es: =head2 Cambiado "I<Invalid range "%s" in transliteration operator>" (Rango "%s" inválido en el operador de transliteración)

source: =head2 Scalar value constructors X<scalar, literal> X<scalar, constant>
es_es: =head2 Constructores de valores escalares X<scalar, literal> X<scalar, constant> X<escalar, literal> X<escalar, constante>

source: =item fork X<fork> X<child> X<parent>
es_es: =item fork X<fork> X<child> X<parent> X<hijo> X<padre>

source: You can force Perl to skip the test and never recompile by adding a C</o> (which stands for "once") after the trailing delimiter.
es_es: Puede forzar a Perl para saltar el test y nunca volver a recompilar, mediante la adición de un C</o> (que significa "una vez") después del delimitador final.

source: In list context, it returns a list of the substrings matched by any capturing parentheses in the regular expression.
es_es: En contexto de lista, devuelve una lista de las subcadenas coincidentes con los paréntesis de captura de la expresión regular.

source: However, a tiny change to this pattern
es_es: Sin embargo, con un pequeño cambio en este patrón

source: For example if you have C<qr/$a$b/>, and C<$a> contained C<"\g1">, and C<$b> contained C<"37">, you would get C</\g137/> which is probably not what you intended.
es_es: Por ejemplo, si tiene C<qr/$a$b/>, y C<$a> conteniendo C<"\g1"> y C<$b> conteniendo C<"37">, obtendrá C<\g137/>, que, probablemente, no será lo que pretendía.

source: It's important you make sure to use the C<[ ]> array reference constructor.
es_es: Es importante que esté seguro de que está utilizando el constructor de referencia a array C<[]>.

source: Look-around assertions are zero-width patterns which match a specific pattern without including it in C<$&>.
es_es: Las aserciones cercanas (I<Look-around assertions>) son patrones de ancho cero que coinciden con un patrón específico sin incluirlo en C<$&>.

source: One example is templating systems, another is date and time modules, and there are many more.
es_es: Un ejemplo es el sistema de plantillas, otro son los módulos de fecha y hora, y hay muchos más.

source: printf '<%.1e>', 10; # prints "<1.0e+01>"
es_es: printf '<%.1e>', 10; # imprime "<1.0e+01>"

source: subroutines can now be overridden, autoloaded, and prototyped
es_es: subrutinas que se pueden reemplazar, cargar automáticamente y prototipar

source: On VOS, time values are 32-bit quantities.
es_es: En VOS, los valores de tiempos son cantidades de 32 bits.

source: print reverse; # No output, list context
es_es: print reverse; # No hay salida, contexto lista

source: Opens the file whose filename is given by FILENAME, and associates it with FILEHANDLE.
es_es: Abre el archivo cuyo nombre viene dado por ARCHIVO, y lo asocia con IDENTIFICADOR_ARCHIVO.

source: Raises an exception otherwise.)
es_es: En caso contrario, se levanta una excepción).

source: It also means that recipients of the item may redistribute it under the same conditions they received it.
es_es: También significa que los destinatarios del elemento pueden redistribuirlo bajo las mismas condiciones que lo recibieron.

source: =item I<Intermediate Perl> (the "Alpaca Book")
es_es: =item I<Intermediate Perl> (el "Libro de la Alpaca")

source: # /r with map
es_es: # /r con map

source: For more on formats, see L<perlform>.
es_es: Para más información sobre formatos, vea L<perlform>.

source: Rather, it matched something that happened to be zero characters long.
es_es: Más bien, ha coincidido con algo que parece tener cero caracteres de longitud.

source: Then that text and all remaining text up through and including a line beginning with C<=cut> will be ignored.
es_es: Entonces este texto y el siguiente hasta incluir una línea que comience por C<=cut> será ignorada.

# print "Nagle's algorithm is turned ", $nodelay ? "off " : "on ";
source: print "Nagle's algorithm is turned ", $nodelay ? "off\n" : "on\n";
es_es: print "El algoritmo de Nagle está puesto a ", $nodelay ? "off\n" : "on\n";

source: (Note that this function actually reads a character and then C<ungetc>s it, so isn't useful in an interactive context.) Do not read from a terminal file (or call C<eof(FILEHANDLE)> on it) after end-of-file is reached.
es_es: (Note que esta función realmente lee un carácter y luego hace un C<ungetc>, así que no es útil en un contexto interactivo). No lea de un archivo del que se ha llegado al final (o vuelva a llamar a C<eof(IDENTIFICADOR_ARCHIVO)> sobre él) después de haber alcanzado un fin-de-archivo.

source: Therefore, C<(0|0x)\d*\s\g1\d*> will match "0x1234 0x4321", but not "0x1234 01234", because subpattern 1 matched "0x", even though the rule C<0|0x> could potentially match the leading 0 in the second number.
es_es: Por lo tanto, C<(0|0x)\d*\s\g1\d*> coincidirá con "0x1234 0x4321", pero no con "0x1234 01234", debido a que el subpatrón primero coincidió con "0x", incluso aunque la regla C<0|0x> podría coincidir con el 0 a la izquierda en el segundo número.

source: Thus it can be used to increment a loop variable, even when the loop has been continued via the C<next> statement.
es_es: Así, puede ser usada para incrementar una variable de bucle, incluso cuando el ciclo ha sido parado por medio de la instrucción C<next>.

source: to get a list of anonymous hashes each with only one entry apiece.
es_es: para obtener una lista de hashes anónimos, cada uno con sólo una entrada cada uno.

source: =item Functions for fixed-length data or records
es_es: =item Funciones para registros o datos de longitud fija

source: Perl uses an internal type called a I<typeglob> to hold an entire symbol table entry.
es_es: Perl utiliza un tipo interno que se llama I<typeglob> para mantener una entrada entera en la tabla de símbolos.

source: Hmm... here's the simple way:
es_es: Hmm ... aquí está la forma más sencilla:

source: Choose an appropriate name
es_es: Elija un nombre apropiado

source: On many operating systems, the native text file representation matches the internal representation, but on some platforms the external representation of C<\n> is made up of more than one character.
es_es: En muchos sistemas operativos, la representación nativa de un archivo texto coincide con su representación interna, pero en algunas plataformas la representación externa de C<\n> se realiza con más de un carácter.

source: =item \G assertion
es_es: =item Aserción \G

source: distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.
es_es: distribuir una Versión Estándar de los ejecutables y archivos de biblioteca, junto con instrucciones (en página de manual o equivalente) sobre dónde obtener la Versión Estándar.

source: =head2 FreeBSD core dumps from readdir_r with ithreads
es_es: =head2 FreeBSD vuelca el núcleo desde readdir_r con ithreads

source: The use of these variables incurs no global performance penalty, unlike their punctuation char equivalents, however at the trade-off that you have to tell perl when you want to use them.
es_es: El uso de estas variables no incurre en penalización en el rendimiento global, a diferencia de sus equivalentes de caracteres de puntuación, pero sin embargo, tiene que decirle a perl cuándo desea utilizarlos.

source: The current nonsensical behaviour is always to return false, regardless of whether the hash is empty or has elements.
es_es: El comportamiento sin sentido actual siempre devolvía falso, independientemente de si el hash está vacío o si tiene elementos.

source: =item getsockopt SOCKET,LEVEL,OPTNAME
es_es: =item getsockopt SOCKET,NIVEL,OPCIÓN

source: If you really want to continue using the 5.005 threads but not to see the deprecation warnings, use:
es_es: Si realmente desea seguir utilizando los I<threads> 5.005 pero no quiere ver la advertencia de obsolescencia, utilice:

source: For example, in a destructor of one object you cannot assume that objects of any other class are still available, unless you hold a reference to them.
es_es: Por ejemplo, en un destructor de un objeto no puede asumir que los objetos de cualquier otra clase todavía están disponibles, a menos que mantenga una referencia a ellos.

source: Thanks to Johan Vromans from Squirrel Consultancy.
es_es: Deseo expresar mi agradecimiento a las siguientes personas: Johan Vromans de Squirrel Consultancy.

source: There is a "hints" file for vmesa that specifies the correct values for most things.
es_es: Hay un archivo "hints" (sugerencias) para vmesa que especifica los valores correctos para la mayoría de las cosas.

source: C<\N{U+I<hexadecimal number>}> means the Unicode character whose Unicode code point is I<hexadecimal number>.
es_es: C<\N{U+I<número hexadecimal>}> equivale al carácter Unicode cuyo código punto Unicode sea I<número hexadecimal>.

# print "Defined " if defined $hash{$key};
source: print "Defined\n" if defined $hash{$key};
es_es: print "Definido\n" if defined $hash{$clave};

source: Perl doesn't officially have a no-op operator, but the bare constants C<0> and C<1> are special-cased to not produce a warning in a void context, so you can for example safely do
es_es: Perl, oficialmente, no tiene un operador de no-operación, pero las constantes simples C<0> y C<1> son un caso especial, que no producen una advertencia en un contexto vacío, por lo que puede, por ejemplo, hacer de forma segura

source: This will use miniperl to complete the rest of the build.
es_es: Esto utilizará miniperl para completar el resto de la construcción.

source: These are introduced by a keyword which the extension recognizes, and the syntax following the keyword is defined entirely by the extension.
es_es: Son presentadas por una palabra clave que la extensión reconoce, y la sintaxis que le sigue se define enteramente por la extensión.

source: If the C</g> option is not used, C<m//> in list context returns a list consisting of the subexpressions matched by the parentheses in the pattern, i.e., (C<$1>, C<$2>, C<$3>...).
es_es: Si la opción C</g> no se utiliza, C<m//> en contexto lista devuelve una lista compuesta de las subexpresiones coincidentes por los paréntesis en el patrón, es decir, (C<$1>, C<$2>, C<$3>...).

source: C<NDBM_File> upgraded to version 1.06
es_es: C<NDBM_File> actualizado a la versión 1.06

source: The usual C-style backslash rules apply for making characters such as newline, tab, etc., as well as some more exotic forms.
es_es: Las reglas normales de la barra invertida en el estilo del C se aplican para la creación de caracteres como el salto de línea, tabuladores, etc, así como algunas formas más exóticas.

# 1 + 1, " "; # Obviously not what you meant.
source: 1 + 1, "\n"; # Obviously not what you meant.
es_es: 1 + 1, "\n"; # Obviamente no es lo que quería decir.

source: This is B<not> locking: exclusiveness means here that if the file already exists, sysopen() fails.
es_es: Esto B<no> es bloquear: la exclusividad significa aquí que si el archivo ya existe, sysopen() falla.

source: If, however, the variable has been used in only string contexts since it was set, and has a value that is not the empty string and matches the pattern C</^[a-zA-Z]*[0-9]*\z/>, the increment is done as a string, preserving each character within its range, with carry:
es_es: Sin embargo, si la variable se ha utilizado sólo en contextos de cadena desde que se creó, y tiene un valor que no es la cadena vacía y coincide con el patrón C</^[a-zA-Z]*[0-9]*\z/>, el incremento se realiza como una cadena, conservando cada carácter dentro de su rango, conllevando a:

source: Because C<$> or C<@> trigger interpolation, you'll need to use something like C</\Quser\E\@\Qhost/> to match them literally.
es_es: Debido a que C<$> o C<@> disparan la interpolación, tendrá que usar algo como C</\Quser\E\@\Qhost/> para coincidir con ellos literalmente.

source: Within any delimiters for such a construct, allowed spaces are not affected by C</x>, and depend on the construct.
es_es: Para una construcción como esta, con cualquier tipo de delimitadores, los espacios permitidos no se verán afectados por C</x>, y depende de la propia construcción.

source: my (@length_content) = unpack "(V/a)*", $binary;
es_es: my (@contenido_longitud) = unpack "(V/a)*", $binario;

source: If such scripts or library files are aggregated with this Package via the so-called "undump" or "unexec" methods of producing a binary executable image, then distribution of such an image shall neither be construed as a distribution of this Package nor shall it fall under the restrictions of Paragraphs 3 and 4, provided that you do not represent such an executable image as a Standard Version of this Package.
es_es: Si los scripts o archivos de biblioteca son agregados con este Paquete a través de los métodos "undump" o "unexec" para la producción de una imagen ejecutable binaria, entonces, la distribución de esta imagen no se interpretará como una distribución de este Paquete, ni caerá bajo las restricciones de los párrafos 3 y 4, siempre y cuando usted no intente representar que es una imagen ejecutable de una Versión Estándar de este Paquete.

source: Perl was originally a language optimized for scanning arbitrary text files, extracting information from those text files, and printing reports based on that information.
es_es: Perl era un lenguaje optimizado para procesar archivos de texto, a fin de extraer información y utilizarla para generar informes.

source: 9 mtime last modify time in seconds since the epoch
es_es: 9 mtime tiempo última modificación, en segundos desde el epoch

source: Both C<-T> and C<-B> return true on an empty file, or a file at EOF when testing a filehandle.
es_es: Ambos, C<-T> y C<-B>, devuelven verdadero en un archivo vacío o en un archivo en el EOF (marca de fin de archivo) cuando se analiza un identificador de archivo.

source: perl582delta - what is new for perl v5.8.2
es_es: perl582delta - Qué hay de nuevo en perl v5.8.2

source: Each of the elementary pieces of regular expressions which were described before (such as C<ab> or C<\Z>) could match at most one substring at the given position of the input string.
es_es: Cada una de las piezas elementales de las expresiones regulares que se ha descrito anteriormente (por ejemplo, C<ab> o C<\Z>) podría coincidir como mucho con una subcadena en la posición indicada de la cadena de entrada.

source: If C<-T> or C<-B> is used on a filehandle, the current IO buffer is examined rather than the first block.
es_es: Si C<-T> o C<-B> se usan con un identificador de archivo, la memoria intermedia actual de IO es examinada en vez del primer bloque.

source: This has been corrected.
es_es: Esto ha sido corregido.

source: Instead of running C<make test>, set C<TEST_JOBS> in your environment to the number of tests to run in parallel, and run C<make test_harness>.
es_es: En lugar de ejecutar C<make test>, ponga en su entorno la variable C<TEST_JOBS> al número de pruebas que se deben ejecutar en paralelo, y ejecute C<make test_harness>.

source: B<WARNING>: If the filehandle is marked C<:utf8>, Unicode characters encoded in UTF-8 are written instead of bytes, and the LENGTH, OFFSET, and return value of syswrite() are in (UTF8-encoded Unicode) characters.
es_es: B<ADVERTENCIA>: Si el identificador de archivo está marcado como C<:utf8>, caracteres Unicode codificados en UTF-8 son escritos en lugar de bytes, y la LONGITUD, DESPLAZAMIENTO y el valor de retorno de syswrite() estarán basados en caracteres (Unicode codificados en UTF-8).

source: If any part of LIST is an array, C<foreach> will get very confused if you add or remove elements within the loop body, for example with C<splice>.
es_es: Si cualquier parte de la LISTA es un array, C<foreach> quedará confundido si añade o quita elementos dentro del cuerpo del bucle, por ejemplo, al usar C<splice>.

source: B<-E> is equivalent to B<-e>, but it implicitly enables all optional features (like C<use feature ":5.10">).
es_es: B<-E> es equivalente a B<-e>, pero implícitamente activa todas las características opcionales (igual que C<use feature ":5.10">).

source: This prohibition interacts with backtracking (see L<"Backtracking">), and so the I<second best> match is chosen if the I<best> match is of zero length.
es_es: Esta prohibición se relaciona con dar la marcha atrás (vea L<"Marcha atrás">), por lo que la I<segunda mejor> coincidencia es elegida si la I<mejor> coincidencia es de longitud cero.

source: =head1 Selected Bug Fixes
es_es: =head1 Arreglo de determinados errores

source: =item precision, or maximum width X<precision>
es_es: =item precisión, o ancho máximo X<precision> X<precisión>

source: Here's a (relatively expensive) work-around to compare whether two floating-point numbers are equal to a particular number of decimal places.
es_es: Aquí hay un (relativamente caro) ejemplo en torno a cómo comprobar si dos números de punto flotante son iguales en un determinado número de decimales.

source: An array represents a list of values:
es_es: Un array representa una lista de valores:

source: See also L</"Switch statements">.
es_es: Ver también L</"Instrucciones Switch">.

# print "The square of $answer is ", $answer * $answer, " ";
source: print "The square of $answer is ", $answer * $answer, "\n";
es_es: print "El cuadrado de $respuesta es ", $respuesta * $respuesta, "\n";

source: But that doesn't help you.
es_es: Pero esto no le servirá de nada.

source: Perl operations which take a numeric argument treat that argument in one of four different ways: they may force it to one of the integer/floating/ string formats, or they may behave differently depending on the format of the operand.
es_es: En Perl, las operaciones que consumen un argumento numérico tratan al argumento de una de cuatro maneras posibles: pueden forzar la conversión a uno de los formatos de entero/número de punto flotante/cadena, o pueden comportarse de una manera diferente en función del formato del operando.

source: (Perl has many other internal optimizations, but none would be triggered in the above example if we did not use qr() operator.)
es_es: (Perl tiene otras muchas optimizaciones internas, pero ninguna será activada en el ejemplo anterior si no usamos el operador qr()).

source: perl -le '$a = "NaN"; print "No NaN support here" if $a == $a'
es_es: perl -le '$a = "NaN"; print "No tiene soporte NaN" if $a == $a'

source: or gripe(), next LINE;
es_es: or gripe(), next LINEA;

source: Consider changing your whole world view.
es_es: Considere cambiar su punto de vista vital.

source: Binary "&" returns its operands ANDed together bit by bit.
es_es: Binario "&" devuelve la operación AND, bit a bit, de sus operandos.

source: It is complicated by the need to cross compile.
es_es: Es complicado, por la necesidad de hacer una compilación cruzada.
